[
    {
        "Course ID": "CIS 171",
        "Course Name": "Computer Programming I",
        "Credit Hours": "3",
        "Course Description": "A study of the design of algorithms, pseudocode, data types, control structures, arrays, program testing, and text file processing using a high-level programming language.",
        "Prerequisite": "",
        "Semester Offered": "Fall",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 172",
        "Course Name": "Computer Programming II",
        "Credit Hours": "3",
        "Course Description": "A continuation of CIS 171. Emphasis is on object-oriented constructs and techniques, generics and use of common data structures supported by the language",
        "Prerequisite": "CIS 171",
        "Semester Offered": "Spring",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 211",
        "Course Name": "Introduction to Web Design",
        "Credit Hours": "3",
        "Course Description": "An interdisciplinary introduction to web design covering both technical and artistic aspects. The course will cover the current tools and technologies used for web design and development. Emphasis will also be given to the artistic principles relevant to good web design. Students will design, develop, and critique websites.",
        "Prerequisite": "",
        "Semester Offered": "Spring",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 267",
        "Course Name": "Application Development I (W)",
        "Credit Hours": "3",
        "Course Description": "Windows-based program development using visual languages, editors and programming tools. This course contains a significant writing component.",
        "Prerequisite": "",
        "Semester Offered": "Fall",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 273",
        "Course Name": "Data Structures",
        "Credit Hours": "3",
        "Course Description": "A continuation of CIS 172. A study of the use of data structures in the design and implementation of software. Topics may include linked lists, stacks, queues and trees, and their proper application. ",
        "Prerequisite": "CIS 172",
        "Semester Offered": "Fall",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 324",
        "Course Name": "Database Systems",
        "Credit Hours": "3",
        "Course Description": "A study of the major data models with emphasis on relational systems. Topics include database design, database implementation, database processing, and security. Project work will include creating and modifying databases using Structured Query Language (SQL) and Query By Example (QBE). Current commercial databases will also be studied.",
        "Prerequisite": "",
        "Semester Offered": "Fall",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 345",
        "Course Name": "Computer Networks",
        "Credit Hours": "3",
        "Course Description": "An overview of computer networking principles and practices. Topics include networking theory, layered protocols, Internet addressing, network topologies, network architectures, and network implementation.",
        "Prerequisite": "",
        "Semester Offered": "Spring",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 367",
        "Course Name": "Application Development II",
        "Credit Hours": "3",
        "Course Description": "Windows-based program development using visual languages, editors and programming tools. This course contains a significant writing component.",
        "Prerequisite": "",
        "Semester Offered": "Fall",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 374",
        "Course Name": "Algorithms",
        "Credit Hours": "3",
        "Course Description": "A continuation of topics introduced in CIS 273. Topics may include sorting and searching techniques, graphs, relative and hashed files, use of data structures as abstractions of problems, and algorithmic complexity (O-notation).",
        "Prerequisite": "CIS 273",
        "Semester Offered": "Spring",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 460",
        "Course Name": "Operating Systems (W)",
        "Credit Hours": "3",
        "Course Description": "Principles of design and operation of computer operating systems. Topics include processes, threads, memory management, scheduling, file systems, input and output, concurrency, and performance",
        "Prerequisite": "",
        "Semester Offered": "Spring - Odd",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 474",
        "Course Name": "Artificial Intelligence",
        "Credit Hours": "3",
        "Course Description": "A survey of and an introduction to various topics in artificial intelligence. Topics include expert systems, automatic problem-solving, natural language processing, uncertainty management, knowledge representation, and machine learning.",
        "Prerequisite": "",
        "Semester Offered": "Fall - Even",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 491",
        "Course Name": "Advanced Topics in Computer Science (W)",
        "Credit Hours": "3",
        "Course Description": "A capstone course for exploring advanced theoretical concepts and current issues in computer science. A major independent research project will be required. This course includes a significant writing component. Prerequisite: Senior standing (90+ hours).",
        "Prerequisite": "",
        "Semester Offered": "Spring",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "MAT 235",
        "Course Name": "Introductory Statistics",
        "Credit Hours": "3",
        "Course Description": "An introduction to basic statistical techniques, including frequency distributions, averages, data analysis, samplings, tests of hypothesis, linear regression, chi-square tests, and related areas in probability theory. Prerequisite: Two (2) years of high school algebra and required proficiency score of 21 or better on math portion of the ACT or proficiency score on the ACCUPLACER.",
        "Prerequisite": "",
        "Semester Offered": "Spring, Fall",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "MAT 240",
        "Course Name": "Discrete Mathematics",
        "Credit Hours": "3",
        "Course Description": "A study in the mathematics that deals with \"separated\" or discrete sets of objects rather than with continuous sets such as the real line. Topics include set theory, combinatorics, logic, introductory proof techniques, introduction to matrix algebra, relations and graphs, functions, recursion and recurrence relations, graphs, and data trees.",
        "Prerequisite": "",
        "Semester Offered": "Spring",
        "Category": "CS",
        "Subcategory": "CS Core"
    },
    {
        "Course ID": "CIS 368",
        "Course Name": "Software Engineering (W)",
        "Credit Hours": "3",
        "Course Description": "A study of software engineering from initial concept through design, development, testing, and maintenance of the product. Discussion covers software development life cycle models. Topics include quality, validation and verification, and human factors. This course includes a significant writing component.",
        "Prerequisite": "CIS 267",
        "Semester Offered": "Fall - Odd",
        "Category": "CS",
        "Subcategory": "SD"
    },
    {
        "Course ID": "CIS 386",
        "Course Name": "Architecture and Assembly Language",
        "Credit Hours": "3",
        "Course Description": "An introduction to the low-level architecture of modern computer systems. Architecture topics include registers, pipelining, data representation, input, and output. Information covered will be illustrated using assembly language.",
        "Prerequisite": "CIS 273",
        "Semester Offered": "Fall - Even",
        "Category": "CS",
        "Subcategory": "SD"
    },
    {
        "Course ID": "CIS 444",
        "Course Name": "Parallel Programming",
        "Credit Hours": "3",
        "Course Description": "An introduction to the fundamentals of parallel and distributed computation. Topics include parallel architectures, parallel algorithm design, and parallel programming techniques. Modern parallel architectures such as computer clusters and GPUs will be emphasized.",
        "Prerequisite": "CIS 374",
        "Semester Offered": "Fall - Odd",
        "Category": "CS",
        "Subcategory": "SD"
    },
    {
        "Course ID": "CIS 470",
        "Course Name": "Programming Languages: Theory & Practice",
        "Credit Hours": "3",
        "Course Description": "The principles of programming language design and implementation. Topics include formal language theory, language paradigms, and language evaluation. Students will write programs in several modern languages including non-imperative languages.",
        "Prerequisite": "CIS 273",
        "Semester Offered": "Fall - Odd",
        "Category": "CS",
        "Subcategory": "SD"
    },
    {
        "Course ID": "MAT 223",
        "Course Name": "Analytics and Calculus II",
        "Credit Hours": "4",
        "Course Description": "A continuation of MAT 122. Applications of the definite integral, techniques of integration, paratmetric equations, polar coordinates, and infinite sequences and series are the main topics of this course.",
        "Prerequisite": "MAT 122",
        "Semester Offered": "Fall",
        "Category": "CS",
        "Subcategory": "SD"
    },
    {
        "Course ID": "PHS 212",
        "Course Name": "Physics for Science and Engineering II (W)",
        "Credit Hours": "4",
        "Course Description": "A continuation of PHS 211 and a requirement of all pre-engineering, chemistry and biochemistry students. This course introduces students to thermodynamics, the kinetic theory of gases, electric fields and potential, capacitance, resistance, AC and DC circuits, magnetic fields, inductance, electromagnetic waves, light, optics, interference diffraction, and selected topics dealing with relativity, quantum mechanics, and nuclear physics. This course meets for three (3) hours of lecture and three (3) hours of laboratory each week. This course contains a significant writing component.",
        "Prerequisite": "PHS 211",
        "Semester Offered": "Spring",
        "Category": "CS",
        "Subcategory": "SD"
    }
]