[{
    "id": "BIB 121",
    "name": "Life of Christ",
    "hours": "2",
    "description": "A thorough textual study of the life of Jesus the Christ. Emphasis is given to his virgin birth, his message and ministry, his crucifixion, his resurrection, and his ascension, all leading to a greater awareness of his greatness as the Son of God and Savior of the world. Moral, doctrinal, historical, and practical aspects of the life of Christ are also emphasized. (Text course.)",
    "prerequisite": "",
    "semesteroffered": "Fall",
    "category": "LAC",
    "subcategory": "Bible"
    },
    {
    "id": "BIB 122",
    "name": "Acts of the Apostles",
    "hours": "2",
    "description": "The story of the early church in Acts. Attention is given to cases of conversion, the outstanding personalities in Acts, and the missionary journeys of Paul. This is the missions book of the New Testament.",
    "prerequisite": "",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Bible"
    },
    {
    "id": "BIB 346",
    "name": "Foundations of Faith",
    "hours": "3",
    "description": "Foundational principles for the development of a personal faith. This course will challenge the student to engage the essentials of the Christian belief in God, the Bible, and Jesus Christ as they impact spiritual formation in our contemporary world.",
    "prerequisite": "",
    "semesteroffered": "Summer, Fall, Spring",
    "category": "LAC",
    "subcategory": "Bible"
    },
    {
    "id": "BIB 446",
    "name": "Christian Evidences",
    "hours": "3",
    "description": "An examination of evidences that prove the Christian faith is from God. Attention is given to systems of thought that oppose the Christian faith, and a response to each is offered. The arguments for the existence of God, the inspiration of the Bible, and the deity of Jesus are considered in detail. This course contains a significant writing component.",
    "prerequisite": "",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Bible"
    },
    {
    "id": "ENG 101",
    "name": "English Composition I",
    "hours": "3",
    "description": "First-year composition. This course focuses on student development of clear thought and expression through writing. Class time will be devoted to exploring and developing ideas, practicing steps of the writing process, and discussing various styles and patterns of exposition. This course is designed to provide students with tools in critical analysis and effective communication used in subsequent courses.",
    "prerequisite": "A minimum score of 17 on the English portion of the ACT or a passing grade in ENG 100 Introduction to College Writing.",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Written Communication"
    },
    {
    "id": "ENG 102",
    "name": "English Composition II",
    "hours": "3",
    "description": "An introduction to research and argumentative writing. Students write research papers, critical essays, and argumentative essays using MLA style.",
    "prerequisite": "ENG 101 English Composition I or the equivalent.",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Written Communication"
    },
    {
    "id": "COM 140",
    "name": "Speech Communication ",
    "hours": "3",
    "description": "An introduction to the basic concepts of human communication theory with instruction and practice in interpersonal communication, small group communication, and public speaking.",
    "prerequisite": "",
    "semesteroffered": "Summer, Fall, Spring",
    "category": "LAC",
    "subcategory": "Oral Communication"
    },
    {
    "id": "MAT 100",
    "name": "Fundamental Concepts of Mathematics ",
    "hours": "3",
    "description": "A study of fundamental concepts in mathematical topics which may include sets, logic, systems of numeration, systems of weight and measure, algebra, geometry, consumer mathematics, probability, and statistics. This course does not prepare students for MAT 101 College Algebra.",
    "prerequisite": "Required proficiency score of 17 or better on the math portion of the ACT or proficiency score on the ACCUPLACER.",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Quantitative Reasoning"
    },
    {
    "id": "MAT 101",
    "name": "College Algebra",
    "hours": "3",
    "description": "A study of functions and graphs, polynomial functions, rational and root functions, and exponential and logarithmic functions. This course may also include systems of equations and inequalities, sequences, series, and probability.",
    "prerequisite": "Two (2) years of high school algebra.",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Quantitative Reasoning"
    },
    {
    "id": "MAT 120",
    "name": "Pre-Calculus ",
    "hours": "4",
    "description": "A study of polynomial and rational functions, exponential and logarithmic functions, trigonometric functions, and trigonometric identities. This course is designed to strengthen a student's technical skills and conceptual understanding in mathematics in order to be prepared for calculus.",
    "prerequisite": "Two (2) years of high school algebra and a score of 24 or better on the math portion of the ACT or MAT 101 College Algebra with a minimum grade of \"C.\"",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Quantitative Reasoning"
    },
    {
    "id": "MAT 122",
    "name": "Analytics and Calculus I",
    "hours": "4",
    "description": "A study of limits, derivatives, applications of derivatives, integrals, and applications of integrals. These topics are studied for a variety of functions of a single variable including polynomial, rational, root, trigonometric, inverse trigonometric, exponential, logarithmic, and hyperbolic functions.",
    "prerequisite": "A high school trigonometry or pre-calculus course and a score of 27 or better on the math portion of the ACT or MAT 120 Pre-Calculus with a minimum grade of \"C.\"",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Quantitative Reasoning"
    },
    {
    "id": "MAT 235",
    "name": "Introducing Statistics",
    "hours": "3",
    "description": "An introduction to basic statistical techniques, including frequency distributions, averages, data analysis, samplings, tests of hypothesis, linear regression, chi-square tests, and related areas in probability theory.",
    "prerequisite": "Two (2) years of high school algebra and required proficiency score of 21 or better on math portion of the ACT or proficiency score on the ACCUPLACER.",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Quantitative Reasoning"
    },
    {
    "id": "BIB/FAM 230",
    "name": "Marriage and the Family",
    "hours": "3",
    "description": "An introduction to the basic principles that are needed in creating a happy and successful marriage and family life. A Biblical perspective is used to consider such topics as sex roles, dating, marriageability, mixed marriages, engagement, sex adjustment, in-law adjustment, financial adjustment, life insurance, divorce, reproduction, family planning, and child rearing.",
    "prerequisite": "",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Behavioral Sciences"
    },
    {
    "id": "PSY 210",
    "name": "General Psychology",
    "hours": "3",
    "description": "An introduction to the science of psychology. The course prepares the student for further study in the science of human behavior and mental processes",
    "prerequisite": "",
    "semesteroffered": "Summer, Fall, Spring",
    "category": "LAC",
    "subcategory": "Behavioral Sciences"
    },
    {
    "id": "SOC 241",
    "name": "General Sociology",
    "hours": "3",
    "description": "An introduction to the general principles of sociology, giving a broad perspective of the nature of society and its problems in terms of social institutions, forces, and changes.",
    "prerequisite": "",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Behavioral Sciences"
    },
    {
    "id": "SWK 251",
    "name": "Human Behavior in the Social Environment I: Childhood and Adolescents",
    "hours": "3",
    "description": "A study of a people-in-systems theoretical orientation for knowledge and understanding of human behavior in the social environment. The student will be introduced to a range of concepts that relate to human development and diversity within social systems from childhood to adolescence and that will be useful to the assessment of and intervention with people/system problems as they are encountered in social work practice.",
    "prerequisite": "",
    "semesteroffered": "Summer, Fall",
    "category": "LAC",
    "subcategory": "Behavioral Sciences"
    },
    {
    "id": "BIO 100",
    "name": "Human Biology",
    "hours": "3",
    "description": "A non-biology majors introduction to the basic structure and function of the human body and human genetics. Areas to which the students are introduced include: tissues, organs, and organ systems of the human body and their functions. ",
    "prerequisite": "",
    "semesteroffered": "Summer, Fall",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "BIO 105",
    "name": "Principles of Conservation Biology",
    "hours": "3",
    "description": "A study of conservation biology for both majors and non-majors. Emphasis will be on basic biological concepts that will enable students to appreciate and understand their role within the living world. Topics will include, but are not limited to, scientific method, ecosystems, genetic diversity, extinction, maintaining biodiversity, and human influences on biodiversity.",
    "prerequisite": "",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "BIO 110",
    "name": "Principles of Biology",
    "hours": "3",
    "description": "A study of biology for non-majors. Emphasis will be on basic biological concepts that will enable students to appreciate the living world and their relationship to it. Topics will include, but are not limited to, scientific method, the cell and genetic basis of life, mitosis and meiosis reproduction, biodiversity, and ecology.",
    "prerequisite": "",
    "semesteroffered": "Summer, Fall, Spring",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "BIO 111",
    "name": "General Biology I",
    "hours": "3",
    "description": "A general survey of the major kingdoms (except Animalia) and the phyla of plants throughout the world. This course introduces students to basic cell structure, energy transfer, metabolic processes, reproduction, taxonomic, and ecological aspects of plants.",
    "prerequisite": "",
    "semesteroffered": "Fall",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "BIO 112",
    "name": "General Biology II",
    "hours": "4",
    "description": "A general survey of the major animal-like protists and animal phyla throughout the world. This course also introduces students to basic cell structure, cell division, reproduction, and genetics.",
    "prerequisite": "",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "BIO 211",
    "name": "Human Anatomy & Physiology I",
    "hours": "4",
    "description": "Part one of a two-semester study of the structure and function of the human body. This course orients the student with the major chemistry, cell biology, and tissue structure of the human body then continues with examination of the gross and microscopic anatomy and physiology of the integumentary, skeletal, muscular, and nervous body systems.",
    "prerequisite": "",
    "semesteroffered": "Summer, Fall, Spring",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "CHE 121",
    "name": "General Chemistry I WITH",
    "hours": "3",
    "description": "A study of the basic concepts of general chemistry. This study will include the atomic theory, atomic structure, chemical bonding, the periodic law, and calculations relating to stoichiometry and the gas laws.",
    "prerequisite": "",
    "semesteroffered": "Fall",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "CHE 121L",
    "name": "General Chemistry I Lab",
    "hours": "1",
    "description": "Special emphasis is given to quantitative methods.",
    "prerequisite": "",
    "semesteroffered": "Fall",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "PHS 111",
    "name": "Physical Science I",
    "hours": "3",
    "description": "An introduction to the physical sciences including topics from geology, introductory chemistry, and astronomy.",
    "prerequisite": "",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "PHS 112",
    "name": "Physical Science II",
    "hours": "3",
    "description": "An introduction to the physical sciences including topics from general physics and meteorology.",
    "prerequisite": "",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "PHS 201",
    "name": "General Physics I",
    "hours": "4",
    "description": "An algebra-based study of physics. This course introduces students to kinematics in one and two dimensions, kinetics, friction, work, energy, momentum, rotational dynamics, gravitation, static equilibrium, fluid mechanics, thermodynamics, waves, and sound.",
    "prerequisite": "MAT 120 Pre-Calculus.",
    "semesteroffered": "Fall",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "PHS 211",
    "name": "Physics for Science and Engineering I",
    "hours": "4",
    "description": "A calculus-based study of physics designed primarily for students majoring in chemistry, mathematics, computer science, and pre-engineering. This course is required of all pre-engineering, chemistry, and biochemistry students and is recommended for students certifying to teach physics in the secondary schools. This course introduces students to kinematics in one and two dimensions, kinetics, friction, work, energy, momentum, rotational dynamics, gravitation, static equilibrium, fluid mechanics, thermodynamics, waves, and sound.",
    "prerequisite": "MAT 122 Analytics and Calculus I.",
    "semesteroffered": "Fall",
    "category": "LAC",
    "subcategory": "Natural Sciences"
    },
    {
    "id": "HIS 111",
    "name": "Survey of Civilization I",
    "hours": "3",
    "description": "A survey of world history from the fourth millennium B.C. into the 16th century. Particular attention is paid to change over time, connections and cultural exchanges between different peoples, and to comparisons between different civilizations.",
    "prerequisite": "",
    "semesteroffered": "Fall",
    "category": "LAC",
    "subcategory": "History"
    },
    {
    "id": "HIS 112",
    "name": "Survey of Civilization II",
    "hours": "3",
    "description": "A continuation of HIS 111. This course surveys world history from the 16th century to the present and examines the relationships between nationalism, industrialization, imperialism, political ideologies, and globalization.",
    "prerequisite": "",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "History"
    },
    {
    "id": "HIS 221",
    "name": "American History I",
    "hours": "3",
    "description": "A survey of United States history from pre-Columbian times to 1877. This course is a survey of the major events including colonization, American Revolution, national expansion, the Civil War, and Reconstruction.",
    "prerequisite": "",
    "semesteroffered": "Summer, Fall, Spring",
    "category": "LAC",
    "subcategory": "History"
    },
    {
    "id": "HIS 222",
    "name": "American History II",
    "hours": "3",
    "description": "A continuation of HIS 221. This course is a survey of major developments including expansion, industrialization, reform, foreign policy, politics, and cultural changes.",
    "prerequisite": "",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "History"
    },
    {
    "id": "POL 251",
    "name": "Fundamentals of Political Geography",
    "hours": "3",
    "description": "An introduction to political geography. This course will explore how geography shapes our politics and how politics, in turn, shapes and has shaped the geography of the globe. Major topics include the origin, location, and evolution of states, the defining and drawing of political boundaries, territorial conflicts and disputes, the impact of boundaries on personal and cultural identity, centripetal and centrifugal forces that encourage the success or failure of political units, effects of colonialism, and geopolitics.",
    "prerequisite": "",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "History"
    },
    {
    "id": "ART 110",
    "name": "Art Appreciation",
    "hours": "3",
    "description": "An introductory course to acquaint students with the principles of art found in art works of various periods and cultures. A chronological survey of artists and their work is explored emphasizing the elements of art and the processes involved in their production.",
    "prerequisite": "",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "ART 234",
    "name": "Introduction to Creativity",
    "hours": "3",
    "description": "A course emphasizing the tools, skills, and processes used in creative thinking and creative problem-solving to develop novel and useful ideas. This course includes a significant writing component. prerequisites: Approval of instructor.",
    "prerequisite": "",
    "semesteroffered": "Offered On Sufficient Demand.",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "ENG 225",
    "name": " English Literature I",
    "hours": "3",
    "description": "A survey of British literature from the Anglo-Saxon period to the present. This course exposes students to a wide range of writers, periods, literary movements, and currents of thought in iterature from the English-speaking world, excluding the United States. This course meets the University's Liberal Arts Core requirement for Creative and Critical Works.",
    "prerequisite": "ENG 101 English Composition I1",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "ENG 226",
    "name": "English Literature II",
    "hours": "3",
    "description": "A survey of English literature from the Romantic period to the present. This course exposes students to a wide range of writers, periods, literary movements, and currents of thought in later English literature.",
    "prerequisite": "ENG 102 English Composition II",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "ENG 235",
    "name": "American Literature I",
    "hours": "3",
    "description": "A survey of American literature from the colonial period to the present. This course exposes students to a wide range of writers, periods, literary movements, and currents of thought in American literature. This course meets the University's Liberal Arts Core requirement for Creative and Critical Works.",
    "prerequisite": "ENG 101 English Composition I ",
    "semesteroffered": "Fall, Spring",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "ENG 236",
    "name": "American Literature II",
    "hours": "3",
    "description": "A survey of American literature from the Civil War to the present. This course exposes students to a wide range of writers, periods, literary movements, and currents of thought in later American literature.",
    "prerequisite": " ENG 102 English Composition II ",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "ENG 245",
    "name": "World Literature I",
    "hours": "3",
    "description": "A survey of world literature from ancient times through the 16th century. This course exposes students to a wide range of writers, periods, and currents of thought in world literature.",
    "prerequisite": "ENG 102 English Composition II",
    "semesteroffered": "Fall",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "ENG 246",
    "name": "World Literature II",
    "hours": "3",
    "description": "A survey of western literature, excluding British and American works, from the 17th century to the present. This course exposes students to a wide range of writers, periods, literary movements, and currents of thought in modern western literature.",
    "prerequisite": "ENG 102 English Composition II",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "MUS 110",
    "name": "Music Appreciation",
    "hours": "3",
    "description": "A study of the principles and techniques that underlie artistic creation in music, such as form, theme, rhythm, mood, tone, and harmony and their relation to principles in other art media. A brief survey of the history of music is made in which the various periods in music with their characteristics and stylistic differences are emphasized. ",
    "prerequisite": "",
    "semesteroffered": "Summer, Fall, Spring",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "MUS 214",
    "name": "Development of American Music",
    "hours": "3",
    "description": "A history of aspects of American music beginning with Native American music. Emphasis will be given to a study of music from 1900 to present including the study of popular music and performers.",
    "prerequisite": "",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "PHI 243",
    "name": "Introduction to Philosophy",
    "hours": "3",
    "description": "Introductory principles and problems of philosophy. Consideration is given to various views of truth, nature, man, and values. This course includes a significant writing component. ",
    "prerequisite": "",
    "semesteroffered": "Spring Even",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "PHI 245",
    "name": "History of Philosophy I",
    "hours": "3",
    "description": "The history of philosophy from the perspectives of representative philosophers in the ancient and medieval periods. Emphasis is given to analysis and to criticism. This course includes a significant writing component. ",
    "prerequisite": "",
    "semesteroffered": "Spring Odd",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "PHI 246",
    "name": "History of Philosophy II",
    "hours": "3",
    "description": "The history of philosophy from the perspectives of representative philosophers in the modern and contemporary periods. Emphasis is given to analysis and to criticism. This course includes a significant writing component. ",
    "prerequisite": "",
    "semesteroffered": "Spring Even",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "THE 160",
    "name": "Introduction to Theatre",
    "hours": "3",
    "description": "A survey of theatre practice and principles. The course provides an audience-centered overview of all aspects of theatre production from play writing to play presentation. Attendance at FHU Theatre productions is required.",
    "prerequisite": "",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "THE 265",
    "name": "Acting I",
    "hours": "3",
    "description": "Introduction to basic acting using Stanislavski techniques. Emphasis is on character development, vocal delivery, and physical behavior required to play a role in contemporary theatre. Scene work and journaling required. Attendance at FHU Theatre productions is required.",
    "prerequisite": "",
    "semesteroffered": "Fall",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "THE 299A/399A",
    "name": "New York Theatre Survey",
    "hours": "3",
    "description": "An overview of the history of New York theatre, focusing primarily on Manhattan's Broadway theatre district. The student will explore the cultural, artistic, and economic issues central to Broadway theatre. The course includes a trip to New York and attendance of several Broadway shows. Cost of New York trip is in addition to the comprehensive charge.",
    "prerequisite": "",
    "semesteroffered": "Spring",
    "category": "LAC",
    "subcategory": "Critical and Creative Works"
    },
    {
    "id": "BIB/HUM 495",
    "name": "Values in Human Thought",
    "hours": "3",
    "description": "An exploration of value issues and opportunities for further learning in the liberal arts and sciences. This course will focus on Christian perspectives in value questions that the graduate will confront in art, music, literature, economics, science, politics, and other related areas.",
    "prerequisite": "Senior standing",
    "semesteroffered": "Summer, Fall, Spring",
    "category": "LAC",
    "subcategory": ""
    }
]